grevaillot/svd_tools/headers/ATSAMR34J16B/tcc0.h
/** TCC0_CTRLA_RUNSTDBY Run in Standby **/
#define TCC0_CTRLA_RUNSTDBY		(1 << 11)

#define TCC0_CTRLA_PRESCALER_SHIFT		8
#define TCC0_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tcc0_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/


#define TCC0_CTRLA_RESOLUTION_SHIFT		5
#define TCC0_CTRLA_RESOLUTION_MASK		0x03
/** @defgroup tcc0_ctrla_resolution RESOLUTION Enhanced Resolution
@{*/
/**@}*/

/** TCC0_CTRLA_ENABLE Enable **/
#define TCC0_CTRLA_ENABLE		(1 << 1)
/** TCC0_CTRLA_SWRST Software Reset **/
#define TCC0_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc0_ctrlbclr CTRLBCLR Control B Clear
@{*/


#define TCC0_CTRLBCLR_CMD_SHIFT		5
#define TCC0_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tcc0_ctrlbclr_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC0_CTRLBCLR_IDXCMD_SHIFT		3
#define TCC0_CTRLBCLR_IDXCMD_MASK		0x03
/** @defgroup tcc0_ctrlbclr_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC0_CTRLBCLR_ONESHOT One-Shot **/
#define TCC0_CTRLBCLR_ONESHOT		(1 << 2)
/** TCC0_CTRLBCLR_LUPD Lock Update **/
#define TCC0_CTRLBCLR_LUPD		(1 << 1)
/** TCC0_CTRLBCLR_DIR Counter Direction **/
#define TCC0_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc0_ctrlbset CTRLBSET Control B Set
@{*/


#define TCC0_CTRLBSET_CMD_SHIFT		5
#define TCC0_CTRLBSET_CMD_MASK		0x07
/** @defgroup tcc0_ctrlbset_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC0_CTRLBSET_IDXCMD_SHIFT		3
#define TCC0_CTRLBSET_IDXCMD_MASK		0x03
/** @defgroup tcc0_ctrlbset_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC0_CTRLBSET_ONESHOT One-Shot **/
#define TCC0_CTRLBSET_ONESHOT		(1 << 2)
/** TCC0_CTRLBSET_LUPD Lock Update **/
#define TCC0_CTRLBSET_LUPD		(1 << 1)
/** TCC0_CTRLBSET_DIR Counter Direction **/
#define TCC0_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc0_syncbusy SYNCBUSY Synchronization Busy
@{*/

/** TCC0_SYNCBUSY_CC3 Compare Channel 3 Busy **/
#define TCC0_SYNCBUSY_CC3		(1 << 11)
/** TCC0_SYNCBUSY_CC2 Compare Channel 2 Busy **/
#define TCC0_SYNCBUSY_CC2		(1 << 10)
/** TCC0_SYNCBUSY_CC1 Compare Channel 1 Busy **/
#define TCC0_SYNCBUSY_CC1		(1 << 9)
/** TCC0_SYNCBUSY_CC0 Compare Channel 0 Busy **/
#define TCC0_SYNCBUSY_CC0		(1 << 8)
/** TCC0_SYNCBUSY_PER Period Busy **/
#define TCC0_SYNCBUSY_PER		(1 << 7)
/** TCC0_SYNCBUSY_WAVE Wave Busy **/
#define TCC0_SYNCBUSY_WAVE		(1 << 6)
/** TCC0_SYNCBUSY_PATT Pattern Busy **/
#define TCC0_SYNCBUSY_PATT		(1 << 5)
/** TCC0_SYNCBUSY_COUNT Count Busy **/
#define TCC0_SYNCBUSY_COUNT		(1 << 4)
/** TCC0_SYNCBUSY_STATUS Status Busy **/
#define TCC0_SYNCBUSY_STATUS		(1 << 3)
/** TCC0_SYNCBUSY_CTRLB Ctrlb Busy **/
#define TCC0_SYNCBUSY_CTRLB		(1 << 2)
/** TCC0_SYNCBUSY_ENABLE Enable Busy **/
#define TCC0_SYNCBUSY_ENABLE		(1 << 1)
/** TCC0_SYNCBUSY_SWRST Swrst Busy **/
#define TCC0_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc0_fctrla FCTRLA Recoverable Fault A Configuration
@{*/


#define TCC0_FCTRLA_FILTERVAL_SHIFT		24
#define TCC0_FCTRLA_FILTERVAL_MASK		0x0f
/** @defgroup tcc0_fctrla_filterval FILTERVAL Fault A Filter Value
@{*/
/**@}*/


#define TCC0_FCTRLA_BLANKVAL_SHIFT		16
#define TCC0_FCTRLA_BLANKVAL_MASK		0xff
/** @defgroup tcc0_fctrla_blankval BLANKVAL Fault A Blanking Time
@{*/
/**@}*/

/** TCC0_FCTRLA_BLANKPRESC Fault A Blanking Prescaler **/
#define TCC0_FCTRLA_BLANKPRESC		(1 << 15)

#define TCC0_FCTRLA_CAPTURE_SHIFT		12
#define TCC0_FCTRLA_CAPTURE_MASK		0x07
/** @defgroup tcc0_fctrla_capture CAPTURE Fault A Capture Action
@{*/
/**@}*/


#define TCC0_FCTRLA_CHSEL_SHIFT		10
#define TCC0_FCTRLA_CHSEL_MASK		0x03
/** @defgroup tcc0_fctrla_chsel CHSEL Fault A Capture Channel
@{*/
/**@}*/


#define TCC0_FCTRLA_HALT_SHIFT		8
#define TCC0_FCTRLA_HALT_MASK		0x03
/** @defgroup tcc0_fctrla_halt HALT Fault A Halt Mode
@{*/
/**@}*/

/** TCC0_FCTRLA_RESTART Fault A Restart **/
#define TCC0_FCTRLA_RESTART		(1 << 7)

#define TCC0_FCTRLA_BLANK_SHIFT		5
#define TCC0_FCTRLA_BLANK_MASK		0x03
/** @defgroup tcc0_fctrla_blank BLANK Fault A Blanking Mode
@{*/
/**@}*/

/** TCC0_FCTRLA_QUAL Fault A Qualification **/
#define TCC0_FCTRLA_QUAL		(1 << 4)
/** TCC0_FCTRLA_KEEP Fault A Keeper **/
#define TCC0_FCTRLA_KEEP		(1 << 3)

#define TCC0_FCTRLA_SRC_SHIFT		0
#define TCC0_FCTRLA_SRC_MASK		0x03
/** @defgroup tcc0_fctrla_src SRC Fault A Source
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_fctrlb FCTRLB Recoverable Fault B Configuration
@{*/


#define TCC0_FCTRLB_FILTERVAL_SHIFT		24
#define TCC0_FCTRLB_FILTERVAL_MASK		0x0f
/** @defgroup tcc0_fctrlb_filterval FILTERVAL Fault B Filter Value
@{*/
/**@}*/


#define TCC0_FCTRLB_BLANKVAL_SHIFT		16
#define TCC0_FCTRLB_BLANKVAL_MASK		0xff
/** @defgroup tcc0_fctrlb_blankval BLANKVAL Fault B Blanking Time
@{*/
/**@}*/

/** TCC0_FCTRLB_BLANKPRESC Fault B Blanking Prescaler **/
#define TCC0_FCTRLB_BLANKPRESC		(1 << 15)

#define TCC0_FCTRLB_CAPTURE_SHIFT		12
#define TCC0_FCTRLB_CAPTURE_MASK		0x07
/** @defgroup tcc0_fctrlb_capture CAPTURE Fault B Capture Action
@{*/
/**@}*/


#define TCC0_FCTRLB_CHSEL_SHIFT		10
#define TCC0_FCTRLB_CHSEL_MASK		0x03
/** @defgroup tcc0_fctrlb_chsel CHSEL Fault B Capture Channel
@{*/
/**@}*/


#define TCC0_FCTRLB_HALT_SHIFT		8
#define TCC0_FCTRLB_HALT_MASK		0x03
/** @defgroup tcc0_fctrlb_halt HALT Fault B Halt Mode
@{*/
/**@}*/

/** TCC0_FCTRLB_RESTART Fault B Restart **/
#define TCC0_FCTRLB_RESTART		(1 << 7)

#define TCC0_FCTRLB_BLANK_SHIFT		5
#define TCC0_FCTRLB_BLANK_MASK		0x03
/** @defgroup tcc0_fctrlb_blank BLANK Fault B Blanking Mode
@{*/
/**@}*/

/** TCC0_FCTRLB_QUAL Fault B Qualification **/
#define TCC0_FCTRLB_QUAL		(1 << 4)
/** TCC0_FCTRLB_KEEP Fault B Keeper **/
#define TCC0_FCTRLB_KEEP		(1 << 3)

#define TCC0_FCTRLB_SRC_SHIFT		0
#define TCC0_FCTRLB_SRC_MASK		0x03
/** @defgroup tcc0_fctrlb_src SRC Fault B Source
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_wexctrl WEXCTRL Waveform Extension Configuration
@{*/


#define TCC0_WEXCTRL_DTHS_SHIFT		24
#define TCC0_WEXCTRL_DTHS_MASK		0xff
/** @defgroup tcc0_wexctrl_dths DTHS Dead-time High Side Outputs Value
@{*/
/**@}*/


#define TCC0_WEXCTRL_DTLS_SHIFT		16
#define TCC0_WEXCTRL_DTLS_MASK		0xff
/** @defgroup tcc0_wexctrl_dtls DTLS Dead-time Low Side Outputs Value
@{*/
/**@}*/

/** TCC0_WEXCTRL_DTIEN3 Dead-time Insertion Generator 3 Enable **/
#define TCC0_WEXCTRL_DTIEN3		(1 << 11)
/** TCC0_WEXCTRL_DTIEN2 Dead-time Insertion Generator 2 Enable **/
#define TCC0_WEXCTRL_DTIEN2		(1 << 10)
/** TCC0_WEXCTRL_DTIEN1 Dead-time Insertion Generator 1 Enable **/
#define TCC0_WEXCTRL_DTIEN1		(1 << 9)
/** TCC0_WEXCTRL_DTIEN0 Dead-time Insertion Generator 0 Enable **/
#define TCC0_WEXCTRL_DTIEN0		(1 << 8)

#define TCC0_WEXCTRL_OTMX_SHIFT		0
#define TCC0_WEXCTRL_OTMX_MASK		0x03
/** @defgroup tcc0_wexctrl_otmx OTMX Output Matrix
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_drvctrl DRVCTRL Driver Control
@{*/


#define TCC0_DRVCTRL_FILTERVAL1_SHIFT		28
#define TCC0_DRVCTRL_FILTERVAL1_MASK		0x0f
/** @defgroup tcc0_drvctrl_filterval1 FILTERVAL1 Non-Recoverable Fault Input 1 Filter Value
@{*/
/**@}*/


#define TCC0_DRVCTRL_FILTERVAL0_SHIFT		24
#define TCC0_DRVCTRL_FILTERVAL0_MASK		0x0f
/** @defgroup tcc0_drvctrl_filterval0 FILTERVAL0 Non-Recoverable Fault Input 0 Filter Value
@{*/
/**@}*/

/** TCC0_DRVCTRL_INVEN7 Output Waveform 7 Inversion **/
#define TCC0_DRVCTRL_INVEN7		(1 << 23)
/** TCC0_DRVCTRL_INVEN6 Output Waveform 6 Inversion **/
#define TCC0_DRVCTRL_INVEN6		(1 << 22)
/** TCC0_DRVCTRL_INVEN5 Output Waveform 5 Inversion **/
#define TCC0_DRVCTRL_INVEN5		(1 << 21)
/** TCC0_DRVCTRL_INVEN4 Output Waveform 4 Inversion **/
#define TCC0_DRVCTRL_INVEN4		(1 << 20)
/** TCC0_DRVCTRL_INVEN3 Output Waveform 3 Inversion **/
#define TCC0_DRVCTRL_INVEN3		(1 << 19)
/** TCC0_DRVCTRL_INVEN2 Output Waveform 2 Inversion **/
#define TCC0_DRVCTRL_INVEN2		(1 << 18)
/** TCC0_DRVCTRL_INVEN1 Output Waveform 1 Inversion **/
#define TCC0_DRVCTRL_INVEN1		(1 << 17)
/** TCC0_DRVCTRL_INVEN0 Output Waveform 0 Inversion **/
#define TCC0_DRVCTRL_INVEN0		(1 << 16)
/** TCC0_DRVCTRL_NRV7 Non-Recoverable State 7 Output Value **/
#define TCC0_DRVCTRL_NRV7		(1 << 15)
/** TCC0_DRVCTRL_NRV6 Non-Recoverable State 6 Output Value **/
#define TCC0_DRVCTRL_NRV6		(1 << 14)
/** TCC0_DRVCTRL_NRV5 Non-Recoverable State 5 Output Value **/
#define TCC0_DRVCTRL_NRV5		(1 << 13)
/** TCC0_DRVCTRL_NRV4 Non-Recoverable State 4 Output Value **/
#define TCC0_DRVCTRL_NRV4		(1 << 12)
/** TCC0_DRVCTRL_NRV3 Non-Recoverable State 3 Output Value **/
#define TCC0_DRVCTRL_NRV3		(1 << 11)
/** TCC0_DRVCTRL_NRV2 Non-Recoverable State 2 Output Value **/
#define TCC0_DRVCTRL_NRV2		(1 << 10)
/** TCC0_DRVCTRL_NRV1 Non-Recoverable State 1 Output Value **/
#define TCC0_DRVCTRL_NRV1		(1 << 9)
/** TCC0_DRVCTRL_NRV0 Non-Recoverable State 0 Output Value **/
#define TCC0_DRVCTRL_NRV0		(1 << 8)
/** TCC0_DRVCTRL_NRE7 Non-Recoverable State 7 Output Enable **/
#define TCC0_DRVCTRL_NRE7		(1 << 7)
/** TCC0_DRVCTRL_NRE6 Non-Recoverable State 6 Output Enable **/
#define TCC0_DRVCTRL_NRE6		(1 << 6)
/** TCC0_DRVCTRL_NRE5 Non-Recoverable State 5 Output Enable **/
#define TCC0_DRVCTRL_NRE5		(1 << 5)
/** TCC0_DRVCTRL_NRE4 Non-Recoverable State 4 Output Enable **/
#define TCC0_DRVCTRL_NRE4		(1 << 4)
/** TCC0_DRVCTRL_NRE3 Non-Recoverable State 3 Output Enable **/
#define TCC0_DRVCTRL_NRE3		(1 << 3)
/** TCC0_DRVCTRL_NRE2 Non-Recoverable State 2 Output Enable **/
#define TCC0_DRVCTRL_NRE2		(1 << 2)
/** TCC0_DRVCTRL_NRE1 Non-Recoverable State 1 Output Enable **/
#define TCC0_DRVCTRL_NRE1		(1 << 1)
/** TCC0_DRVCTRL_NRE0 Non-Recoverable State 0 Output Enable **/
#define TCC0_DRVCTRL_NRE0		(1 << 0)

/**@}*/

/** @defgroup tcc0_dbgctrl DBGCTRL Debug Control
@{*/

/** TCC0_DBGCTRL_FDDBD Fault Detection on Debug Break Detection **/
#define TCC0_DBGCTRL_FDDBD		(1 << 2)
/** TCC0_DBGCTRL_DBGRUN Debug Running Mode **/
#define TCC0_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tcc0_evctrl EVCTRL Event Control
@{*/

/** TCC0_EVCTRL_MCEO3 Match or Capture Channel 3 Event Output Enable **/
#define TCC0_EVCTRL_MCEO3		(1 << 27)
/** TCC0_EVCTRL_MCEO2 Match or Capture Channel 2 Event Output Enable **/
#define TCC0_EVCTRL_MCEO2		(1 << 26)
/** TCC0_EVCTRL_MCEO1 Match or Capture Channel 1 Event Output Enable **/
#define TCC0_EVCTRL_MCEO1		(1 << 25)
/** TCC0_EVCTRL_MCEO0 Match or Capture Channel 0 Event Output Enable **/
#define TCC0_EVCTRL_MCEO0		(1 << 24)
/** TCC0_EVCTRL_MCEI3 Match or Capture Channel 3 Event Input Enable **/
#define TCC0_EVCTRL_MCEI3		(1 << 19)
/** TCC0_EVCTRL_MCEI2 Match or Capture Channel 2 Event Input Enable **/
#define TCC0_EVCTRL_MCEI2		(1 << 18)
/** TCC0_EVCTRL_MCEI1 Match or Capture Channel 1 Event Input Enable **/
#define TCC0_EVCTRL_MCEI1		(1 << 17)
/** TCC0_EVCTRL_MCEI0 Match or Capture Channel 0 Event Input Enable **/
#define TCC0_EVCTRL_MCEI0		(1 << 16)
/** TCC0_EVCTRL_TCEI1 Timer/counter Event 1 Input Enable **/
#define TCC0_EVCTRL_TCEI1		(1 << 15)
/** TCC0_EVCTRL_TCEI0 Timer/counter Event 0 Input Enable **/
#define TCC0_EVCTRL_TCEI0		(1 << 14)
/** TCC0_EVCTRL_TCINV1 Inverted Event 1 Input Enable **/
#define TCC0_EVCTRL_TCINV1		(1 << 13)
/** TCC0_EVCTRL_TCINV0 Inverted Event 0 Input Enable **/
#define TCC0_EVCTRL_TCINV0		(1 << 12)
/** TCC0_EVCTRL_CNTEO Timer/counter Output Event Enable **/
#define TCC0_EVCTRL_CNTEO		(1 << 10)
/** TCC0_EVCTRL_TRGEO Retrigger Output Event Enable **/
#define TCC0_EVCTRL_TRGEO		(1 << 9)
/** TCC0_EVCTRL_OVFEO Overflow/Underflow Output Event Enable **/
#define TCC0_EVCTRL_OVFEO		(1 << 8)

#define TCC0_EVCTRL_CNTSEL_SHIFT		6
#define TCC0_EVCTRL_CNTSEL_MASK		0x03
/** @defgroup tcc0_evctrl_cntsel CNTSEL Timer/counter Output Event Mode
@{*/
/**@}*/


