grevaillot/svd_tools/headers/ATSAMR34J16B/tcc0.h
#define TCC0_CC1_CC_SHIFT		0
#define TCC0_CC1_CC_MASK		0xffffff
/** @defgroup tcc0_cc1_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc1_dith4 CC1DITH4 Compare and Capture
@{*/


#define TCC0_CC1_DITH4_CC_SHIFT		4
#define TCC0_CC1_DITH4_CC_MASK		0xfffff
/** @defgroup tcc0_cc1_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC1_DITH4_DITHER_SHIFT		0
#define TCC0_CC1_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc0_cc1_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc1_dith5 CC1DITH5 Compare and Capture
@{*/


#define TCC0_CC1_DITH5_CC_SHIFT		5
#define TCC0_CC1_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc0_cc1_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC1_DITH5_DITHER_SHIFT		0
#define TCC0_CC1_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc0_cc1_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc1_dith6 CC1DITH6 Compare and Capture
@{*/


#define TCC0_CC1_DITH6_CC_SHIFT		6
#define TCC0_CC1_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc0_cc1_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC1_DITH6_DITHER_SHIFT		0
#define TCC0_CC1_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc0_cc1_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc2 CC2 Compare and Capture
@{*/


#define TCC0_CC2_CC_SHIFT		0
#define TCC0_CC2_CC_MASK		0xffffff
/** @defgroup tcc0_cc2_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc2_dith4 CC2DITH4 Compare and Capture
@{*/


#define TCC0_CC2_DITH4_CC_SHIFT		4
#define TCC0_CC2_DITH4_CC_MASK		0xfffff
/** @defgroup tcc0_cc2_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC2_DITH4_DITHER_SHIFT		0
#define TCC0_CC2_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc0_cc2_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc2_dith5 CC2DITH5 Compare and Capture
@{*/


#define TCC0_CC2_DITH5_CC_SHIFT		5
#define TCC0_CC2_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc0_cc2_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC2_DITH5_DITHER_SHIFT		0
#define TCC0_CC2_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc0_cc2_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc2_dith6 CC2DITH6 Compare and Capture
@{*/


#define TCC0_CC2_DITH6_CC_SHIFT		6
#define TCC0_CC2_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc0_cc2_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC2_DITH6_DITHER_SHIFT		0
#define TCC0_CC2_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc0_cc2_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc3 CC3 Compare and Capture
@{*/


#define TCC0_CC3_CC_SHIFT		0
#define TCC0_CC3_CC_MASK		0xffffff
/** @defgroup tcc0_cc3_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc3_dith4 CC3DITH4 Compare and Capture
@{*/


#define TCC0_CC3_DITH4_CC_SHIFT		4
#define TCC0_CC3_DITH4_CC_MASK		0xfffff
/** @defgroup tcc0_cc3_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC3_DITH4_DITHER_SHIFT		0
#define TCC0_CC3_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc0_cc3_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc3_dith5 CC3DITH5 Compare and Capture
@{*/


#define TCC0_CC3_DITH5_CC_SHIFT		5
#define TCC0_CC3_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc0_cc3_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC3_DITH5_DITHER_SHIFT		0
#define TCC0_CC3_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc0_cc3_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_cc3_dith6 CC3DITH6 Compare and Capture
@{*/


#define TCC0_CC3_DITH6_CC_SHIFT		6
#define TCC0_CC3_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc0_cc3_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC0_CC3_DITH6_DITHER_SHIFT		0
#define TCC0_CC3_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc0_cc3_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_pattbuf PATTBUF Pattern Buffer
@{*/

/** TCC0_PATTBUF_PGVB7 Pattern Generator 7 Output Enable **/
#define TCC0_PATTBUF_PGVB7		(1 << 15)
/** TCC0_PATTBUF_PGVB6 Pattern Generator 6 Output Enable **/
#define TCC0_PATTBUF_PGVB6		(1 << 14)
/** TCC0_PATTBUF_PGVB5 Pattern Generator 5 Output Enable **/
#define TCC0_PATTBUF_PGVB5		(1 << 13)
/** TCC0_PATTBUF_PGVB4 Pattern Generator 4 Output Enable **/
#define TCC0_PATTBUF_PGVB4		(1 << 12)
/** TCC0_PATTBUF_PGVB3 Pattern Generator 3 Output Enable **/
#define TCC0_PATTBUF_PGVB3		(1 << 11)
/** TCC0_PATTBUF_PGVB2 Pattern Generator 2 Output Enable **/
#define TCC0_PATTBUF_PGVB2		(1 << 10)
/** TCC0_PATTBUF_PGVB1 Pattern Generator 1 Output Enable **/
#define TCC0_PATTBUF_PGVB1		(1 << 9)
/** TCC0_PATTBUF_PGVB0 Pattern Generator 0 Output Enable **/
#define TCC0_PATTBUF_PGVB0		(1 << 8)
/** TCC0_PATTBUF_PGEB7 Pattern Generator 7 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB7		(1 << 7)
/** TCC0_PATTBUF_PGEB6 Pattern Generator 6 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB6		(1 << 6)
/** TCC0_PATTBUF_PGEB5 Pattern Generator 5 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB5		(1 << 5)
/** TCC0_PATTBUF_PGEB4 Pattern Generator 4 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB4		(1 << 4)
/** TCC0_PATTBUF_PGEB3 Pattern Generator 3 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB3		(1 << 3)
/** TCC0_PATTBUF_PGEB2 Pattern Generator 2 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB2		(1 << 2)
/** TCC0_PATTBUF_PGEB1 Pattern Generator 1 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB1		(1 << 1)
/** TCC0_PATTBUF_PGEB0 Pattern Generator 0 Output Enable Buffer **/
#define TCC0_PATTBUF_PGEB0		(1 << 0)

/**@}*/

/** @defgroup tcc0_perbuf PERBUF Period Buffer
@{*/


#define TCC0_PERBUF_PERBUF_SHIFT		0
#define TCC0_PERBUF_PERBUF_MASK		0xffffff
/** @defgroup tcc0_perbuf_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc0_perbuf_dith4 PERBUFDITH4 Period Buffer
@{*/


#define TCC0_PERBUF_DITH4_PERBUF_SHIFT		4
#define TCC0_PERBUF_DITH4_PERBUF_MASK		0xfffff
/** @defgroup tcc0_perbuf_dith4_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


